<a href="https://colab.research.google.com/github/sebagit914/Challenge01/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
import pandas as pd
filename = '/content/drive/MyDrive/PTDataScience/PandasForDataManipulation/titanic.csv'
df = pd.read_csv(filename)
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

01. Muestra la cabecera de la trama de datos

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

02.  ¿Cuál es el porcentaje de personas que sobrevivió? (pista: encuentra la media de la columna de supervivencia)

In [ ]:
df['Survived'].mean()*100

38.38383838383838

03. ¿Cuántos de cada sexo sobrevivieron?

In [ ]:
df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).sum()

      Sex  Survived
0  female       233
1    male       109

04. ¿Cuál es el porcentaje de gente que sobrevivió que pagó un pasaje de menos de 10?

In [ ]:
df1 = df

In [ ]:
filtro = df1.loc[df1['Fare']<10, :]
filtro

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0              1         0       3  ...  7.2500   NaN         S
2              3         1       3  ...  7.9250   NaN         S
4              5         0       3  ...  8.0500   NaN         S
5              6         0       3  ...  8.4583   NaN         Q
12            13         0       3  ...  8.0500   NaN         S
..           ...       ...     ...  ...     ...   ...       ...
877          878         0       3  ...  7.8958   NaN         S
878          879         0       3  ...  7.8958   NaN         S
881          882         0       3  ...  7.8958   NaN         S
884          885         0       3  ...  7.0500   NaN         S
890          891         0       3  ...  7.7500   NaN         Q

[336 rows x 12 columns]

In [ ]:
filtro['Survived'].mean()*100

19.940476190476193

06. ¿Cuál es la edad promedio de quienes no sobrevivieron?

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [37]:
df2 = df[df['Survived'] == False]['Age'].mean()
df2

30.62617924528302

06. ¿Cuál es la edad promedio de quienes sobrevivieron?

In [36]:
df1 = df[df['Survived'] == True]['Age'].mean()
df1

28.343689655172415

07. ¿Cuál es la edad promedio de quienes sobrevivieron y no sobrevivieron agrupados por sexo?

In [42]:
df.groupby(['Sex', 'Survived'])['Age'].agg('mean')

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64